Ran Plan for dir: `live/dev/webserver-cluster` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.asg.aws_autoscaling_group.this will be updated in-place
~ resource "aws_autoscaling_group" "this" {
        arn                       = "arn:aws:autoscaling:eu-west-2:565938106136:autoScalingGroup:03693aa0-3e9c-43ec-a65c-e04992b82e3a:autoScalingGroupName/tf-asg-20200515174522807400000002"
        availability_zones        = [
            "eu-west-2a",
            "eu-west-2b",
            "eu-west-2c",
        ]
        default_cooldown          = 300
        desired_capacity          = 1
        enabled_metrics           = []
        force_delete              = false
        health_check_grace_period = 300
        health_check_type         = "ELB"
        id                        = "tf-asg-20200515174522807400000002"
      ~ launch_configuration      = "terraform-20200515174521913700000001" -> (known after apply)
        load_balancers            = []
        max_instance_lifetime     = 0
        max_size                  = 4
        metrics_granularity       = "1Minute"
        min_size                  = 1
        name                      = "tf-asg-20200515174522807400000002"
        protect_from_scale_in     = false
        service_linked_role_arn   = "arn:aws:iam::565938106136:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling"
        suspended_processes       = []
        target_group_arns         = [
            "arn:aws:elasticloadbalancing:eu-west-2:565938106136:targetgroup/tf-atlantis-atlantis/918f644614e06c40",
        ]
        termination_policies      = []
        vpc_zone_identifier       = [
            "subnet-273ae16b",
            "subnet-7fc85c05",
            "subnet-d5367ebc",
        ]
        wait_for_capacity_timeout = "10m"

        tag {
            key                 = "Name"
            propagate_at_launch = true
            value               = "tf-atlantis"
        }
    }

  # module.asg.aws_launch_configuration.this must be replaced
+/- resource "aws_launch_configuration" "this" {
      ~ arn                              = "arn:aws:autoscaling:eu-west-2:565938106136:launchConfiguration:339424e0-6c2e-426d-af5b-5f5e7cdf7f9c:launchConfigurationName/terraform-20200515174521913700000001" -> (known after apply)
        associate_public_ip_address      = false
      ~ ebs_optimized                    = false -> (known after apply)
        enable_monitoring                = true
      ~ iam_instance_profile             = "ora2postgres_atlantis" -> "ora2postgres_ASM_to_EC2" # forces replacement
      ~ id                               = "terraform-20200515174521913700000001" -> (known after apply)
        image_id                         = "ami-01a6e31ac994bbc09"
        instance_type                    = "t2.micro"
        key_name                         = "atlantis"
      ~ name                             = "terraform-20200515174521913700000001" -> (known after apply)
        security_groups                  = [
            "sg-078361ff905e67d19",
            "sg-0b19a6fe443e2d3c0",
            "sg-0ba62d1fc28bcd4fa",
            "sg-0d4f44043f0583462",
        ]
        user_data                        = "1811fa7edc85c2f4a0587e47197a2b48ee86e646"
      - vpc_classic_link_security_groups = [] -> null

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/dev/webserver-cluster`
* :put_litter_in_its_place: To **delete** this plan click [here](http://tf-atlantis-alb-1198755642.eu-west-2.elb.amazonaws.com/events/lock?id=baranovRP%252Ftf-aws-rnbv-complex%252Flive%252Fdev%252Fwebserver-cluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/dev/webserver-cluster`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
